Masmiseim36/nxpSDK/boards/mimxrt700evk/demo_apps/power_mode_comp_only/cm33_core0/hardware_init.c
    DbgConsole_Init(BOARD_DEBUG_UART_INSTANCE, BOARD_DEBUG_UART_BAUDRATE, BOARD_DEBUG_UART_TYPE, uartClkSrcFreq);
}

void DEMO_DeinitDebugConsole(void)
{
    DbgConsole_Deinit();
    CLOCK_AttachClk(kNONE_to_FCCLK0);
}

void BOARD_DisableIoPads()
{
    uint8_t port, pin;

    IOPCTL_PinMuxSet(4U, 11U, 0U);

    if (IS_XIP_XSPI0() == 0U)
    {
        port = 6U;
        for (pin = 0U; pin <= 12U; pin++)
        {
            IOPCTL_PinMuxSet(port, pin, 0U);
        }
    }

    if (IS_XIP_XSPI1() == 0U)
    {
        port = 5U;
        for (pin = 0U; pin <= 20U; pin++)
        {
            IOPCTL_PinMuxSet(port, pin, 0U);
        }
    }
}

void BOARD_InitHardware(void)
{
    BOARD_ConfigMPU();
    BOARD_DisableIoPads();
    BOARD_InitPins();
    BOARD_BootClockRUN();

    DEMO_InitDebugConsole();

    /* BE CAUTIOUS TO SET CORRECT VOLTAGE RANGE ACCORDING TO YOUR BOARD/APPLICATION. PAD SUPPLY BEYOND THE RANGE DO
       HARM TO THE SILICON. */
    POWER_SetPio2VoltRange(kPadVol_300_360);

    /* Initialze power/clock configuration. */
    BOARD_InitPowerConfig();

    /* Boot and wait CPU1 booted. */
    APP_BootCore1();

    /* After the CPU1 booted, CPU0 relinquish the domain's control over the modules, and give the other domain exclusive
     * control. */
    BOARD_PowerConfigAfterCPU1Booted();
}

#if DEMO_POWER_USE_PLL
void BOARD_DisablePll(void)
{
    /* Disable the PFD clock output first. */
    CLOCK_DeinitMainPfd(kCLOCK_Pfd0);
    CLOCK_DeinitAudioPfd(kCLOCK_Pfd3);
    /* Disable PLL. */
    CLOCK_DeinitMainPll();
    CLOCK_DeinitAudioPll();
}

void BOARD_RestorePll(void)
{
    /*Restore PLL*/
    BOARD_BootClockRUN_InitClockModule(kClockModule_MAIN_PLL0);
    BOARD_BootClockRUN_InitClockModule(kClockModule_AUDIO_PLL0);
}
#endif

/*! Disable clock for modules for cpu run only or sleep. */
static inline void BOARD_DisableClocks(void)
{
    CLOCK_DisableClock(kCLOCK_LPI2c15);

    CLOCK_DisableClock(kCLOCK_Gpio7);
    CLOCK_DisableClock(kCLOCK_Mu1);
    CLOCK_DisableClock(kCLOCK_Syscon0);
    CLOCK_DisableClock(kCLOCK_Syscon3);
    CLOCK_DisableClock(kCLOCK_Iopctl0);
    CLOCK_DisableClock(kCLOCK_Iopctl1);
    CLOCK_DisableClock(kCLOCK_Sema420);

#if (DEMO_POWER_USE_PLL == 0U) /* PLL located in VDDN. */
    if (!IS_XIP_XSPI0() && !IS_XIP_XSPI1())
    {
        /* CLKCTL0->FRO0MAXDOMAINEN = 0x21; */
        CLOCK_EnableFro0ClkForDomain(kCLOCK_Vdd2CompDomainEnable);
    }
#endif
    CLOCK_EnableFroClkOutput(FRO0, kCLOCK_FroDiv1OutEn);
}

static inline void BOARD_RestoreClocks(void)
{
    /* Restore clock, power for used modules. */
    CLOCK_EnableFroClkOutput(FRO0, kCLOCK_FroDiv1OutEn | kCLOCK_FroDiv3OutEn | kCLOCK_FroDiv6OutEn);
    CLOCK_EnableFro0ClkForDomain(kCLOCK_Vdd2CompDomainEnable | kCLOCK_VddnComDomainEnable);

    CLOCK_EnableClock(kCLOCK_Syscon0);
    CLOCK_EnableClock(kCLOCK_Syscon3);
    CLOCK_EnableClock(kCLOCK_Iopctl0);
    CLOCK_EnableClock(kCLOCK_Iopctl1);
    CLOCK_EnableClock(kCLOCK_Mu1);
    CLOCK_EnableClock(kCLOCK_Sema420);
    CLOCK_EnableClock(kCLOCK_Gpio7);
    CLOCK_EnableClock(kCLOCK_LPI2c15);
}

void BOARD_RunActiveTest(void)
{
    uint32_t pinCfg[3] = {0}; /* Used for IOPCTL configuration backup. */

    DEMO_LOG("\r\nThis test mode will keep CPU in run mode but close all other unused modules for a while.\n");
    DEMO_LOG("\r\nPlease don't input any charator until the mode finished.\n");

    /* Deinit unused modules. */
    BOARD_PMIC_I2C_Deinit();
    CLOCK_AttachClk(kNONE_to_LPI2C15);
    DEMO_DeinitDebugConsole();
    CLOCK_AttachClk(kNONE_to_FCCLK0);

    pinCfg[0] = IOPCTL0->PIO[0][31];
    pinCfg[1] = IOPCTL0->PIO[1][0];
    pinCfg[2] = IOPCTL0->PIO[0][9];

    CLOCK_DisableClock(kCLOCK_Rtc);
    /* Power down unused modules. */
#if (DEMO_POWER_USE_PLL == 0U) /* PLL located in VDDN. */
    if (!IS_XIP_XSPI0() && !IS_XIP_XSPI1())
    {
        /* XSPI0 and XSPI1 memory interface located in VDDN_COM. */
        POWER_EnablePD(kPDRUNCFG_DSR_VDDN_COM);
        POWER_EnableRunRBB(kPower_BodyBiasVddn);
        POWER_EnablePD(kPDRUNCFG_SHUT_COMNN_MAINCLK);
        POWER_ApplyPD();
    }
#endif
    POWER_EnablePD(kPDRUNCFG_APD_OCOTP);
    POWER_ApplyPD();

    BOARD_DisableClocks();

    /* Note, the debug will not work anymore when the sense shared mainclk is disabled. */
    POWER_EnablePD(kPDRUNCFG_PD_LPOSC);
    BOARD_DisableSharedSenseMainClk();

    CLOCK_DisableClock(kCLOCK_Sleepcon0);

    /* Simulate a task. */
    uint32_t i;
    for (i = 0U; i < 500U; i++)
    {
        SDK_DelayAtLeastUs(10000U, CLOCK_GetCoreSysClkFreq());
    }

    /* Restore clock, power for used modules. */
    CLOCK_EnableClock(kCLOCK_Sleepcon0);

    POWER_DisablePD(kPDRUNCFG_PD_LPOSC);
    BOARD_EnableSharedSenseMainClk();

    BOARD_RestoreClocks();
    CLOCK_EnableClock(kCLOCK_Rtc);
    IOPCTL0->PIO[0][31] = pinCfg[0];
    IOPCTL0->PIO[1][0]  = pinCfg[1];
    IOPCTL0->PIO[0][9]  = pinCfg[2];
#if (DEMO_POWER_USE_PLL == 0U) /* PLL located in VDDN. */
    if (!IS_XIP_XSPI0() && !IS_XIP_XSPI1())
    {
        /* XSPI0 and XSPI1 memory interface located in VDDN_COM. */
        POWER_DisablePD(kPDRUNCFG_DSR_VDDN_COM);
        POWER_EnableRunAFBB(kPower_BodyBiasVddn);
        POWER_DisablePD(kPDRUNCFG_SHUT_COMNN_MAINCLK);
        POWER_ApplyPD();
    }
#endif
    POWER_DisablePD(kPDRUNCFG_APD_OCOTP); /* Need keep OCOTP APD powered for warm reset boot. */
    POWER_ApplyPD();
    DEMO_InitDebugConsole();
    CLOCK_AttachClk(kSENSE_BASE_to_LPI2C15);
    BOARD_PMIC_I2C_Init();
}

void BOARD_EnterSleep(void)
{
    uint32_t irqMask;

    BOARD_PMIC_I2C_Deinit();
    CLOCK_AttachClk(kNONE_to_LPI2C15);
    DEMO_DeinitDebugConsole();
    CLOCK_AttachClk(kNONE_to_FCCLK0);

    BOARD_DisableClocks();

#if (DEMO_POWER_USE_PLL == 0U) /* PLL located in VDDN. */
    if (!IS_XIP_XSPI0() && !IS_XIP_XSPI1())
    {
        /* XSPI0 and XSPI1 memory interface located in VDDN_COM. */
        POWER_EnablePD(kPDRUNCFG_DSR_VDDN_COM);
        POWER_EnableRunRBB(kPower_BodyBiasVddn);
        POWER_EnablePD(kPDRUNCFG_SHUT_COMNN_MAINCLK);
        POWER_ApplyPD();
    }
#endif

    irqMask = DisableGlobalIRQ();

