Masmiseim36/nxpSDK/boards/mimxrt700evk/demo_apps/power_mode_comp_only/cm33_core0/hardware_init.c
    POWER_EnablePD(kPDRUNCFG_PD_LPOSC);
    BOARD_DisableSharedSenseMainClk();

    POWER_EnterSleep();

    POWER_DisablePD(kPDRUNCFG_PD_LPOSC);
    BOARD_EnableSharedSenseMainClk();
    EnableGlobalIRQ(irqMask);
    __ISB();

#if (DEMO_POWER_USE_PLL == 0U) /* PLL located in VDDN. */
    if (!IS_XIP_XSPI0() && !IS_XIP_XSPI1())
    {
        /* XSPI0 and XSPI1 memory interface located in VDDN_COM. */
        POWER_DisablePD(kPDRUNCFG_DSR_VDDN_COM);
        POWER_EnableRunAFBB(kPower_BodyBiasVddn);
        POWER_DisablePD(kPDRUNCFG_SHUT_COMNN_MAINCLK);
        POWER_ApplyPD();
    }
#endif
    BOARD_RestoreClocks();
    DEMO_InitDebugConsole();
    CLOCK_AttachClk(kSENSE_BASE_to_LPI2C15);
    BOARD_PMIC_I2C_Init();
}

void BOARD_EnterDeepSleep(const uint32_t exclude_from_pd[7])
{
#if DEMO_POWER_USE_PLL
    /*
     * Special sequence is needed for the PLL power up/initialization. The application should manually handle the states
     * changes for the PLL if the PLL power states configuration are different in Active mode and Deep Sleep mode. To
     * save power and to be simple, keep the PLL on only when Compute domain is active and sense domain will not use the
     * PLL.
     */
    /* Disable Pll before enter deep sleep mode */
    BOARD_DisablePll();
#endif
    POWER_EnterDeepSleep(exclude_from_pd);
#if DEMO_POWER_USE_PLL
    /* Restore Pll before enter deep sleep mode */
    BOARD_RestorePll();
#endif
}

void BOARD_RequestDSR(const uint32_t exclude_from_pd[7])
{
#if DEMO_POWER_USE_PLL
    /* Disable Pll before enter deep sleep mode */
    BOARD_DisablePll();
#endif
    POWER_EnterDSR(exclude_from_pd);
#if DEMO_POWER_USE_PLL
    /* Restore Pll before enter deep sleep mode */
    BOARD_RestorePll();
#endif
}

void BOARD_RequestDPD(const uint32_t exclude_from_pd[7])
{
#if DEMO_POWER_USE_PLL
    /* Disable Pll. */
    BOARD_DisablePll();
#endif
    POWER_RequestDeepPowerDown(exclude_from_pd);
#if DEMO_POWER_USE_PLL
    /* Restore Pll. The code will not executed if the chip goes into DPD. */
    BOARD_RestorePll();
#endif
}

void BOARD_RequestFDPD(const uint32_t exclude_from_pd[7])
{
#if DEMO_POWER_USE_PLL
    BOARD_DisablePll();
#endif
    POWER_RequestFullDeepPowerDown(exclude_from_pd);
    /* The code will not executed if the chip goes into FDPD. */
#if DEMO_POWER_USE_PLL
    BOARD_RestorePll();
#endif
}
/*${function:end}*/
